app/controllers/banks_controller.rb

  def load_object
    @item = Bank.find_by_id(params[:id])
---
SELECT  "banks".* FROM "banks" WHERE "banks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]