app/controllers/branches_controller.rb

SELECT  "branches".* FROM "branches" WHERE "branches"."ifsc" = $1 LIMIT $2  [["ifsc", "ABHY0065006"], ["LIMIT", 1]]
---
  def load_object
    params[:ifsc] = params[:id] if params[:id].present?
    @item = Branch.find_by_ifsc(params[:ifsc]) # No need to sanitize for sql injection.
  end